Repository: Argonne-EVS/rogue_geonode
Catalog: docs/source/_build/locale/*/LC_MESSAGES/create.po
Languages: es

source: Create a map
es: Crear un mapa

source: New maps can be created from the Maps tab or from a layer.
es: Los nuevos mapas pueden ser creados desde la viñeta de Mapas o desde una capa.

source: **Create a new map**
es: **Cree un nuevo Mapa**

source: In the Maps tab, click on the "Create a New Map" button.
es: En la viñeta de las capas, dele clic a la tecla de "Crear un mapa" que se encuentra a la par de la capa.

source: *Create a New Map*
es: *Cree un nuevo Mapa*

source: **Create a new map from a layer**
es: **Cree un nuevo Mapa desde una capa**

source: In the Layers tab, click on the "Create a map" button next to a layer
es: En la viñeta de las capas, dele clic a la tecla de "Crear un mapa" que se encuentra a la par de la capa

source: *Create a Map from a Layer*
es: *Cree un Mapa desde una Capa*

source: A new map will open with the layer as part of the map.
es: Se abrirá un nuevo mapa con una capa cómo parte del mapa.

source: **Add layers to a map**
es: **Agregue las capas al mapa**

source: Once you have created a map, or opened an existing map, you can add additional layers.
es: Una vez que usted haya creado un mapa o haya abierto un mapa ya existente, Usted puede agregar capas adicionales.

source: Click on the Add Layers button by "Layers"
es: Dele clic a la tecla de Agregar Capas que se encuentra a la par de "Capas"

source: *Add layer*
es: *Agregar Capas*

source: The Add Layers dialog will open.
es: Se abre el dialogo de agregar capas.

source: Click on the checkbox for the layer(s) you want to add to the map.
es: Dele clic a la casilla para chequear la capa o las capas que usted quiere agregar al mapa.

source: Click the Add button.
es: Dele clic a la tecla de Agregar.

source: **Add layers from another server**
es: **Agregue capas desde otro servidor**

source: You can add layers from other servers besides the GeoNode you're working with. These servers include web mapping servers (WMS) and tile servers.
es: Usted puede agregar capas desde los otros servidores que se encuentran en a la par del GeoNode con el que usted está trabajando. Estos servidores incluyen servidores de mapas de la web (WMS) y servidores de mosaicos (tiles).

source: In the Add Layers dialog, click on the drop down for the server list
es: En el dialogo de Agregar Capas, dele clic al menú desplegable desde la lista del servidor

source: *Add new server*
es: *Agregar un nuevo servidor*

source: Click on Add New Server
es: Dele clic en Agregar un Nuevo Servidor

source: In the Add Server dialog enter the type of server (WMS or TMS), a name for the server, and the URL.
es: En el dialogo de agregar un servidor, ingrese el tipo de servidor (WMS o TMS), un nombre para el servidor y el URL.

source: *Server details*
es: *Detalles del Servidor*

source: Click Add to save the server. Once you have added the server, you can select it and add layers to the map.
es: Dele clic a Agregar para salvar el servidor. Una vez que usted haya agregado el servidor, puede seleccionar y agregar las capas al mapa.

source: **Change layer order**
es: **Cambie el orden de la capa**

source: Layers are drawn on the map from bottom to top. The top layer in your layer list will also be on top in the map. Sometimes you need to reorder layers. The following steps explain how.
es: Las capas son dibujadas de abajo hacia arriba en el mapa. La capa de arriba de la lista de su capa, también estará en la parte de arriba del mapa. Algunas veces usted necesitara reorganizar sus capas. Los siguientes pasos explican como.

source: Click on the name of the layer you want to move.
es: Dele clic al nombre de la capa que usted quiere mover.

source: Drag the layer up or down to change it's position in the drawing order.
es: Arrastre la capa hacia arriba o hacia abajo para cambiar su posición en el orden de dibujo.

source: *Change layer order*
es: *Cambiar el orden de las capas*

source: Release the mouse button to finish moving the layer.
es: Suelte el botón del ratón para finalizar el movimiento de la capa.

source: **Toggle layer visibility**
es: **Visibilidad de las Capas de Alternancia**

source: You can turn on and off the visibility for layers in the map. This allows you to "hide" a layer without having to remove it from the map.
es: Usted puede activar y desactivar la visibilidad de las capas del mapa. Esto le permite "esconder" una capa sin tener que eliminarla del mapa.

source: Click on the :guilabel:`Toggle Visibility` button to turn a layer off.
es: Dele clic en la tecla de :guilabel:`Visibilidad de las Capas de Alternancia` para desactivar una capa.

source: Click on the :guilabel:`Toggle Visibility` button again to turn it back on.
es: Dele clic a la tecla de :guilabel:`Visibilidad de las Capas de Alternancia` para volver a activar la capa.

source: **Zoom to data**
es: **Amplíe los Datos**

source: The :guilabel:`Zoom to data` button give you a convenient way to center the map on a layer. Clicking the :guilabel:`Zoom to data` button zooms the map to the extent of the data currently in that layer.
es: La tecla de :guilabel:`Amplíe los datos` le proporciona una forma conveniente de centrar el mapa en la capa. Dele clic a la tecla de :guilabel:`Amplíe los datos` para ampliar el mapa al punto en que actualmente sus datos se encuentran en la capa.

source: Click on the layer name in the layer list in the map. The menu will expand to display additional tools.
es: Dele clic al nombre de la capa en la lista de capas en el mapa. El Menú se expandirá para desplegar las herramientas adicionales.

source: Click on the :guilabel:`Zoom to data` button. The map will zoom to the extent of the data for that layer.
es: Dele clic en la tecla de :guilabel:`Amplíe los datos`. El mapa se ampliara hasta el punto de sus datos para esa capa.

source: *Zoom to data button*
es: *Amplíe a la tecla de datos*

source: Note: if a layer's visibility is dependent on scale, and the data extent is at a smaller scale, you will have to zoom in to be able to view the data.
es: Nota: Si la visibilidad de la capa depende de la escala y el punto de datos se encuentra en una escala más pequeña, usted tendrá que ampliarla a manera de poder ver los datos.

source: **Show layer info**
es: **Muestre la información de la capa**

source: You can view information about a layer in the map. Layer information will include information about the server, basic metadata, and the projection (SRS).
es: Usted podrá ver la información de una capa en el mapa. La información de la capa incluir· información acerca del servidor, los meta datos básicos y la proyección (SRS).

source: Click on the layer name in the layer list to expand the layer options.
es: Dele clic al nombre en la lista de la capa para expandir las opciones de la capa.

source: Click on the :guilabel:`Show layer info` button. The Layer Info window will appear.
es: Dele clic a la tecla de :guilabel:`Muestre la información de la capa`. Aparecerá la ventana de la información de la capa.

source: *Show layer info button*
es: *Muestre la tecla de la información de la capa*

source: *Layer info*
es: *Información de la capa*

source: **Remove a layer from the map**
es: **Elimina una capa del mapa**

source: You can remove a layer from the map.
es: Usted puede eliminar una capa del mapa.

source: Click on the name of the layer you want to remove. The menu will expand to show all of the options for that layer
es: Dele clic al nombre de la capa que usted quiere eliminar. El Menú se abrirá para mostrar todas las opciones para esa capa

source: Click on the :guilabel:`Remove Layer` button.
es: Dele clic a la tecla de :guilabel:`Eliminar una Capa`.

source: *Remove layer button*
es: *La tecla de eliminar una capa*

source: In the confirmation box, click :guilabel:`Yes` to remove the layer.
es: En la casilla de confirmación dele clic a :guilabel:`Sí` para eliminar la capa.

source: *Remove layer confirmation*
es: *Eliminar la confirmación de la capa*

source: **Get feature information**
es: **Obtener la información de las características**

source: In order to get information for features in a vector layer, simply click on the feature in the map.
es: A manera de ordenar para obtener información de las características en una capa de vectores, simplemente dele clic a la caracterÌstica en el mapa.

source: Click on the feature you want information about. The feature info window will appear.
es: Dele clic a la característica de la cual usted quiere obtener información al respecto. Aparecerá la ventana de información de la característica.

source: **Change attribute visibility**
es: **Cambie la visibilidad del atributo**

source: You can control the attributes that appear in the feature info window. This is useful when a layer has a large number of fields.
es: Usted puede controlar los atributos que aparecen en la ventana de información de las características. Esto es de utilidad cuando una capa tiene un gran número de campos.

source: Click on the the layer name in the layer list in the map. The layer will expand to show additional options.
es: Dele clic en la lista en el mapa al nombre de la capa. La capa se abrirá para mostrar opciones adicionales.

source: *Layer attributes*
es: *Atributos de la Capa*

source: Click on the visibility icon for the attributes to toggle their visibility.
es: Dele clic al icono de la visibilidad de los atributos para alternar su visibilidad.

source: *Layer visibility options*
es: *Las opciones de visibilidad de la capa*

source: Click on a feature in that layer. You will see that the attribute fields are now hidden.
es: Dele clic a la caracterÌstica en esa capa. Usted ver· que ahora los campos de los atributos son escondidos.

source: *Feature info with hidden fields*
es: *la información de las características con los campos ocultos*

source: **Using the Legend**
es: **Utilizando la leyenda**

source: The legend displays the symbols used for vector layers in the map (not for imagery). It can be closed to gain screen space and opened when needed. In addition, you can collapse the legend as desired.
es: La leyenda muestra los símbolos utilizados para las capas de los vectores en el mapa (no para imágenes). Esto se puede cerrar para ganar más espacio en la pantalla y puede ser abierto cuando esté se necesite. Agregado a esto, usted puede formar la leyenda como usted lo desee.

source: Toggle the legend by clicking on the :guilabel:`Toggle Legend` button.
es: La alternancia de la leyenda al darle clic a la tecla de :guilabel:`Alternancia de la Leyenda`.

source: *Click the Toggle Legend button to open and close the legend*
es: *Dele clic a la tecla de la alternancia de la leyenda para abrir y cerrar la leyenda*

source: To collapse or expand a layer in the legend, simply click on the layer name in the Legend window.
es: Para contraer o expandir una capa en la leyenda, simplemente dele clic al nombre de la capa en la ventana.

source: *Legend with one layer collapsed*
es: *La leyenda con una capa contraída*

source: **Save a map**
es: **Guardar el Mapa**

source: Saving a map preserves your preferences and makes it available for other GeoNode users.
es: Guardar el mapa preserva sus preferencias y lo pone a la disposición de otros usuarios de GeoNode.

source: Click on the :guilabel:`Save Map` button in the toolbar.
es: Dele clic a la tecla en la barra de herramientas a :guilabel:`Salvar el Mapa`.

source: *Save map button*
es: *La tecla de salvar el mapa*

source: Enter a title and abstract for your map.
es: Ingrese un título y un resumen para su mapa.

source: *Save map dialog*
es: *Salvar el dialogo del mapa*

source: Click :guilabel:`Save`. Notice that the link on the top right of the page changed to reflect the map's name.
es: Dele clic a :guilabel:`Guardar`. Note que el vínculo en la parte superior derecha de la página, ha cambiado para reflejar el nombre del mapa.

source: *Saved map name*
es: *Nombre del mapa Guardado*

source: The map is now saved in the list of maps on the Maps page.
es: Ahora el mapa es guardado en la lista de mapas que se encuentra en la Página de los Mapas.

source: **Create a copy of a map**
es: **Cree una copia del mapa**

source: You can also use a map as a starting point for another map. This allows you to build on the work of others without changing their maps.
es: Usted también puede utilizar un mapa como punto de partida para otro mapa. Esto permite que usted construya sobre el trabajo de otros sin cambiar sus mapas.

source: Click :guilabel:`Save Copy`. Notice that the link on the top right of the page changed to reflect the map's name.
es: Dele clic a:guilabel:`Guardar una copia`. Note que el vínculo en la parte superior derecha de la página ha cambiado para reflejar el nombre del mapa.
