Repository: Argonne-EVS/rogue_geonode
Catalog: docs/source/_build/locale/*/LC_MESSAGES/docupload.po
Languages: es

source: Uploading Documents
es: Cargando los Documentos

source: GeoNode lets you upload documents to associate to layers or maps.
es: GeoNode le permite subir los documentos a las capas o a los mapas asociados.

source: In the documents page, click on :guilabel:`Upload Documents`
es: En la página de los documentos, dele clic a :guilabel:`Upload Documents`

source: *Upload Documents tab*
es: *Viñeta para subir el Documento*

source: Type in the Title for the Document that will appear in GeoNode
es: Escriba el Titulo del Documento que aparecerá en GeoNode

source: Browse to the file to upload or enter the URL for a web page or a document that's online.
es: Navegue hasta el archivo a ser cargado o ingrese a la URL de la página web o a un documento que este en línea.

source: *Upload a Doc as a URL*
es: *Cargue un documento (Doc) como una URL*

source: If you want to link the document to a map or a layer, choose it in the :guilabel:`Link to` section
es: Si usted quiere enlazar el documento a un mapa o a una capa. Escójala en el :guilabel: `Enlace a` la sección

source: Set permissions for who is able to view and manage the document accordingly
es: Establezca los permisos para ver quien, según corresponda, puede ver y administrar el documento.

source: Click on the :guilabel:`Upload` button
es: Dele clic en la tecla de :guilabel:`Subir`

source: The next page will allow you to enter metadata for the document. It's good to enter the Abstract at a minimum.
es: La siguiente página le permitirá ingresar sus metadatos para el documento. Es bueno el poder ingresar el mínimo Abstracto.

source: When you have finished entering metadata click on the :guilabel:`Update` button at the bottom of the page.
es: Cuando usted haya finalizado de ingresar los metadatos, dele clic a la tecla de :guilabel:`Actualizar` en la parte inferior de la página.

source: The document will now be listed in the documents tab.
es: Ahora el documento está en la lista en la viñeta de documentos.
