Repository: Argonne-EVS/rogue_geonode
Catalog: docs/source/_build/locale/*/LC_MESSAGES/edit.po
Languages: es

source: Edit Features
es: Elementos de la Edición

source: Vector layers can be set up so that they're editable. If you have permissions to edit a layer, the editing tools will be available in the map. If a layer is a GeoGit layer, then you can work with the edit history as well.
es: Las capas de los vectores pueden ser configuradas de tal forma que estas puedan ser editables. Si usted tiene los permisos para editar una capa, las herramientas necesarias para editar la capa estarán disponibles en el mapa. Si una capa es una capa de GeoGit, entonces usted también puede trabajar con la historia de la edición.

source: Add a simple point feature to a layer
es: Añadir elemento de un punto simple a una capa

source: If a layer is editable, then the :guilabel:`Add Feature` button will be available next to the layer name.
es: Si una capa es editable, entonces la tecla de :guilabel:`Añadir Elemento` estará disponible a la par del nombre de la capa.

source: *Add feature button*
es: *Añadir Elemento*

source: Click the :guilabel:`Add Feature` button. The :guilabel:`Drawing Geometry` dialog will appear at the top of the map.
es: Dele clic a la tecla de :guilabel:`Añadir Elemento`. El dialogo de :guilabel:`Dibujando la Geometría` aparecerá en la parte superior del mapa.

source: Click on the map to add the geometry. A simple point is placed with one click. The sections below provide additional detail on editing different types of features.
es: Dele clic al mapa para agregar la geometría. Un simple punto se posiciona con un clic. Las secciones a continuación proporcionan detalles adicionales sobre la edición de varios tipos de características diferentes.

source: Click on the :guilabel:`Accept Feature` button to keep the geometry. If you don't want to keep the feature, click the X for the :guilabel:`Cancel Feature` button.
es: Dele clic a la tecla en :guilabel:`Aceptar Funcíon` para mantener la geometría. Si usted no quiere mantener la geometría de la característica, dele clic a la X para la tecla de :guilabel:`Cancelar Funcíon’.

source: Once you click on :guilabel:`Accept Feature` the :guilabel:`Edit Attributes` window will open. Type in the fields or select values from the dropdowns to add attribute values.
es: Una vez que usted le ha dado clic a :guilabel:`Aceptar Funcíon`, la ventana se abrirá. Ingrese en los campos los valores o seleccione los valores del menú desplegable para agregar los valores de los atributos.

source: Click the :guilabel:`Save` button at the bottom of the form to save the feature to the layer.
es: Dele clic a la tecla de :guilabel:`Guardar` en la parte inferior de la plantilla para guardar la característica a la capa.

source: Add a multipoint feature to a layer
es: Añadir elemento de un multipunto a la capa

source: Multipoint features can have more than one point per feature.
es: Un elemento de múltiples puntos puede tener más de un punto.

source: Click the :guilabel:`Add Feature` button. The :guilabel:`Drawing Geometry` dialog will appear at the top of the screen.
es: Dele clic a la tecla de :guilabel:`Añadir Elemento`. El dialogo de :guilabel:`Dibujando la Geometría` aparecerá en la parte superior del mapa.

source: Click on the map to add the first point. Click on the :guilabel:`Add Geometry` button to add another point. Continue to add points for the feature as needed.
es: Dele clic al mapa para agregar el primer punto. Dele clic a la tecla de :guilabel:`Agregar Geometría` para agregar otro punto. Continúe agregando puntos a la característica en la medida que así se necesiten.

source: Click on the :guilabel:`Accept Feature` button to keep the geometries.
es: Dele clic a la tecla de :guilabel:`Aceptar Geometría` para mantener las geometrías.

source: Once you click on :guilabel:`Accept Feature` the :guilabel:`Edit Attributes` window will open. Type in the fields or select values from the dropdowns to add attribute values. .. figure:: img/editattribmulti.png
es: Una vez que le de clic a :guilabel:`Aceptar Geometría` la ventana de :guilabel:`Editar los Atributos` se abrirá. Ingrese los valores en los campos o seleccione los valores desde el menú desplegable para agregar los valores de los atributos.

source: Add a polygon feature to a layer
es: Agregue una elemento de polígono a la capa

source: A simple polygon layer has a single polygon per feature.
es: Una capa de un polígono simple, tiene un solo polígono por elemento.

source: Click on the :guilabel:`Add Feature` button. The :guilabel:`Drawing Geometry` dialog will appear at the top of the screen.
es: Dele clic a la tecla de :guilabel:`Agregar una Elemento`. El dialogo aparecerá en :guilabel:`Dibujando la Geometría` en la parte superior de la pantalla.

source: Click on the map to begin adding the polygon. Continue to click to add all of the vertices. To finalize the polygon, close the geometry by clicking on the first vertice again.
es: Dele clic al mapa para comenzar a agregar al polígono. Continúe dándole clic para agregar todos los vértices. Para finalizar el polígono, cierre la geometría al darle clic nuevamente al primer vértice.

source: If you want the polygon to have right angle corners, you can click on the right angle button.
es: Si usted quiere que el polígono tenga las esquinas con el ángulo correcto, usted puede darle clic a la tecla del ángulo inferior derecho.

source: Add a multipoylgon feature to a layer
es: Agregar una elemento de múltiples polígono a la capa

source: A multipolygon layer has one or more polygons per feature. A couple of examples of multipoygons are the U.S. States of Michigan and Hawaii.
es: Una capa de múltiples polígonos, tiene uno o más polígonos por elemento. Un par de ejemplos de los múltiples polígonos son los Estados Michigan y Hawái en los estados Unidos.

source: Click on the map to begin adding the polygon. Continue to click to add all of the vertices. To finalize the polygon, close the geometry by clicking on the first vertice again. To add another polygon, click on the :guilabel:`Add Geometry` button. Repeat the process to add polygons as needed.
es: Dele clic a la tecla de :guilabel:`Agregar una Característica`. El dialogo de :guilabel:`Dibujando una Geometría` aparecerá en la parte superior de la pantalla.

source: If you want the polygon to have square corners, you can click on the right angle button.
es: Si usted quiere que el polígono tenga las esquinas cuadradas, usted le puede dar clic a la tecla del ángulo derecho.

source: Add a line to a layer
es: Agregar una línea a la capa

source: A line layer consists of lines that represent features - such as roads, powerlines, and other features.
es: Una capa de línea consiste de las líneas que representan las características – tales como ser carreteras, líneas de energía y otro tipo de características.

source: Click on the map to begin adding the linear feature. Continue to click to add all of the vertices. To finalize the line, double-click on the last vertice.
es: Dele clic al mapa para comenzar a agregar los elementos lineares. Continúe dándoles clic para agregar todos los vértices. Para finalizar la línea, dele doble clic en el último vértice.

source: Add a multiline to a layer
es: Agregar múltiples líneas a la capa

source: A multiline layer has one or more polygons per feature.
es: Una capa de múltiples líneas tiene uno o más polígonos por elemento.

source: Click on the map to begin adding the linear feature. Continue to click to add all of the vertices. To finalize the line, double-click on the last vertice. To add another polygon, click on the :guilabel:`Add Geometry` button. Repeat the process to add polygons as needed.
es: Dele clic a la tecla de :guilabel:`Agregar Elemento`. El dialogo de :guilabel:`Dibujar la Geometría` aparecerá en la parte superior de la pantalla.

source: Edit attributes
es: Editar los atributos

source: You can edit the attributes for any features in an editable layer.
es: Usted puede editar los atributos de cualquier característica que se encuentre en una capa editable.

source: Click on the feature on the map. The feature info box will appear.
es: Dele clic a la elemento en el mapa. Aparecerá la casilla de la información del elemento.

source: Click on the :guilabel:`Edit Attibutes` button. The :guilabel`Edit Attributes` window will appear.
es: Dele clic a la tecla de :guilabel:`Editar los Atributos`. Aparecerá la ventana de :guilabel `Editar los Atributos`.

source: Type in the fields or select dropdown values for the fields you want to edit.
es: Introduzca los valores en los campos o seleccione el valor del menú desplegable para los campos que usted quiere editar.

source: Click the :guilabel:`Save` button at the bottom of the form to save the attribute updates.
es: Dele clic a la tecla de :guilabel:`Guardar` en la parte inferior de la plantilla para guardar las actualizaciones del atributo.

source: Edit point geometries on the map
es: Edite un punto de geometrías en el mapa

source: Point layers can be one of two types: simple points and multipoints. For simple points, there is one point per feature. Multipoints can have one or more points per feature.
es: Los puntos de las capas pueden ser una de dos tipos: puntos simples y múltiples puntos. Para los puntos simples, existe un punto por característica. Los múltiples puntos pueden tener uno o más puntos por elemento.

source: Click on the point feature on the map. The feature info box will appear.
es: Dele clic al punto de la elemento en el mapa. Aparecerá la casilla de la información del elemento.

source: Click on the :guilabel:`Edit Geometry` button. The :guilabel:`Drawing Geometry` dialog will appear at the top of the screen, and the selected feature will be highlighted in blue.
es: Dele clic a la tecla de :guilabel:`Editar la geometría `. El dialogo de :guilabel:`Dibujando la geometría ` aparecerá en la parte superior de la pantalla y el elemento seleccionada estará resaltada en azul.

source: Click on the feature and drag it to the new location.
es: Dele clic en el elemento y arrástrelo a la nueva ubicación.

source: Click on the :guilabel:`Accept Feature` button to keep the feature. To cancel the edit, click on the :guilabel:`Cancel Feature` button.
es: Dele clic a la tecla de :guilabel:`Aceptar el Elemento` para mantener la característica. Para cancelar, dele clic a la tecla de :guilabel:`Cancelar el Elemento`.

source: Edit point geometry manually
es: Editar el punto de geometría manualmente

source: With point geometries, you can also manually edit the coordinates. This is useful when you have the coordinates from another source (such as a report).
es: Con las geometrías del punto, usted puede manualmente editar las coordenadas. Esto es muy útil cuando se tiene las coordenadas de otra fuente (como ser de un informe).

source: Click on the :guilabel:`Edit Attributes` button. The :guilabel:`Edit Attributes` window will appear.
es: Dele clic al punto del elemento en el mapa. Aparecerá la casilla con la información del elemento.

source: Click on the coordinates field to edit the point coordinates.
es: Dele clic a la tecla de :guilabel:`Editar los Atributos`. Aparecerá la ventana de :`Editar los Atributos’.

source: Edit polygon and line geometries
es: Editar el polígono y las geometrías de línea

source: Any existing features in an editable layer can be modified. If it is a GeoGit layer, the history of all of the edits will be maintain to ensure the provenance of the data.
es: Se puede editar cualquier elementos existente en una capa editable. Si es una capa de GeoGit, el historial de todas las ediciones se mantendrá para asegurar el origen de los datos.

source: Click on the feature you want to edit. The feature info box will appear.
es: Dele clic a el elemento que usted quiere editar. Aparecerá la casilla de la información del elemento.

source: Click on the :guilabel:`Edit Geometry` button. The :guilabel:`Drawing Geometry` dialog will appear at the top of the screen.
es: Dele clic a la tecla de :guilabel:`Editar la geometría`. El dialogo aparecerá en la parte superior de la pantalla :guilabel:`Dibujando la geometría`.

source: Move the mouse over the geometry to highlight the vertice you want to edit. To move the vertice, click and drag it. Repeat this process until you have completed editing.
es: Mover el ratón sobre la geometría para resaltar el vértice que usted quiere editar. Para mover el vértice, dele clic y arrástrelo. Repita este proceso hasta que usted haya finalizado de editar.
