Repository: Argonne-EVS/rogue_geonode
Catalog: docs/source/_build/locale/*/LC_MESSAGES/geogitsync.po
Languages: es

source: Synchronize GeoGit Repositories
es: Sincronizando las Capas de GeoGit

source: A GeoGit repository can consist of one or more layers (called FeatureTypes). You can set up GeoGit repositories to synchronize changes with each other. This allows you to get updates to layers every few minutes.
es: Los repositorios de GeoGit pueden ser configurados a manera de que se sincronicen cuando el mapa este abierto, con los repositorios a control remoto de GeoGit. Esto le permite a usted compartir con muy poco retraso, las actualizaciones entre los múltiples repositorios con las mismas capas.

source: You can set up repositories to sync in the map. You can set up the sync to occur automatically or only on demand. The sync configurations set up in the map will only occur when the map is open. This allows for a user to be present in case there is any conflict resolution that needs to be done. In order to set up a sync within the map, you will need to have administrator rights to set up the sync and you will need to be authenticated with the server with the remote repositories as well. You will also need to have added the layers you want to sync to the map.
es: Un repositorio de GeoGit puede consistir de una o más capas (llamadas Tipos de Elementos). Usted puede configurar los repositorios de GeoGit a manera de que sincronice los cambios los unos con los otros. Esto le permitirá a usted el obtener las actualizaciones de las capas cada pocos minutos. Usted puede configurar los repositorios a manera de que se sincronicen en el mapa. Usted puede configurar la sincronización a manera de que esta ocurra automáticamente o solo por la demanda. La configuraciones de la sincronización en el mapa solo ocurrirán cuando el mapa este abierto. Esto le permite a un usuario a estar presente en el caso de que haya una resolución de conflicto que necesite llevarse a cabo. A manera de configurar una sincronización dentro del mapa, usted necesita tener los derechos de administrador para poder configurar la sincronización y también usted necesitara estar autenticado con el servidor, así como con los repositorios a control remoto. Usted también necesitara haber agregado las capas que usted quiere sincronizar en el mapa.

source: Configure a Remote Repository
es: Configure un Repositorio a Remoto

source: In order to synchronize you will need to configure the remote repository (or repositories) that GeoGit will sync.
es: A manera de sincronizar, usted necesitara configurar el repositorio o repositorios a remoto, los que GeoGit sincronizara.

source: Click on the :guilabel:`Remote Options` button next to the :guilabel:`Synchronization` tab in the main menu.
es: Dele clic a la tecla de :guilabel:`Opciones a Remoto ` que está al lado de la viñeta de :guilabel:`Sincronización` en el menú principal

source: *Remote Options button to configure remotes*
es: *La Tecla de la Opciones del Remoto para Configurar los Remotos*

source: In the Remote Config window select the GeoGit repo that will be synchronized. The list is populated from the repositories that correspond to the layers in the map.
es: En la ventana de la Configuración a Remoto, seleccione el repositorio de GeoGit que será sincronizado. La lista ha sido poblada de los repositorios que corresponde a las capas en el mapa.

source: Note that even though you might only be working with a single layer, the entire repository contents will be synched. This is important to maintaining the history of the repository.
es: Note que aunque usted puede ser que solamente este trabajando con una sola capa, todos los contenidos del repositorio serán sincronizados. Esto es importante para mantener el historial del repositorio.

source: *Select the repository to sync*
es: *Seleccione el repositorio a ser sincronizado*

source: Choose the name of the :guilabel:`Remote` from the drop down menu. If this is the remote to be set up then there will only be an option for :guilabel:`New Remote`.
es: Escoja el nombre del :guilabel:`Remoto` del menú desplegable. Si este es el remoto a ser configurado, entonces solo habrá una opción para la :guilabel:`Nuevo Remoto`.

source: *Remote Configuration Settings*
es: *Ajustes de la Configuración Remota*

source: In the :guilabel:`Remote Name` field, enter the name you want to call the remote. Do not use spaces or special characters.
es: En el campo de :guilabel:`Nombre Remoto ` ingrese el nombre con el que usted quiere llamar al remoto. No utilice los espacios o caracteres especiales.

source: In the :guilabel:`URL` field, type in the URL to the remote. The URL will have a path with this format: http://<url>/geoserver/geogit/<workspace>:<datastore
es: En el campo de :guilabel:`URL` ingrese el URL al remoto. El URL tendrá un paso con este formato: http://<url>/geoserver/geogit/<workspace>:<datastore

source: If you do not know the workspace and datastore names you can query the server by typing the following URL in a browser. http://<servername>/geoserver/geogit
es: Si usted no conoce el espacio del trabajo y los nombres del almacén de datos, usted puede inquirir al servidor al introducir la siguiente URL en su navegador: http://<servername>/geoserver/geogit

source: *GeoGit Repository List from GeoServer*
es: *La Lista del Repositorio de GeoGit del GeoServer*

source: You can also find the workspace and datastore information by searching through the GeoServer response to a WMS GetCapabilities request. The URL will have this format: http://<servername>/geoserver/wms?SERVICE=WMS&VERSION=1.3.0&REQUEST=GetCapabilities. Search the document for "GEOGIT_ENTRY_POINT"
es: #. Usted también puede encontrar la información de espacios de trabajo y del almacén de datos al buscar a través de la respuesta del GeoServidor al requerimiento de las GetCapabilities de WMS. La URL tendrá el siguiente formato: http://<servername>/geoserver/wms?SERVICE=WMS&VERSION=1.3.0&REQUEST=GetCapabilities. Busque el documento para "GEOGIT_ENTRY_POINT"

source: GeoServer also has information about the GeoGit repositories under :guilabel:`Stores`
es: El GeoServer tambien tiene información acerca de los repositorios de GeoGit bajo :guilabel:`Almacenes`

source: *GeoGit Data Stores in GeoServer*
es: *Los Almacenes de Datos de GeoGit en el GeoServer*

source: Enter the username and password for the remote server.
es: Ingrese el nombre del usuario y la contraseña para el servidor remoto.

source: Click :guilabel:`Save`
es: Dele clic a :guilabel:`Guardar`

source: Add a Sync
es: Agregue una sincronización

source: You can set up syncs with different branches on the same remote. The following steps explain how to add a sync to an existing remote.
es: Usted puede configurar las sincronizaciones con diferentes ramas en el mismo remoto. Los siguientes pasos le explican cómo agregar una sincronización a un remoto existente.

source: To add a sync, click on :guilabel:`Synchronization` in the menu. The menu will expand.
es: Para agregar una sincronización, dele clic a :guilabel:`Sincronización` en el menú. El menú se abrirá.

source: *Synchronization menu*
es: *Menú de Sincronización*

source: Click on the :guilabel:`Add Sync` button
es: Dele clic a la tecla de :guilabel:`Agregar Sincronización`

source: In the Add Sync window enter a name for the sync
es: En la ventana de Agregar Sincronización ingrese el nombre de la sincronización.

source: In the :guilabel:`Repo` field select the repository from the drop down
es: En el campo de :guilabel:`Repositorio` seleccione el repositorio del menú desplegable

source: *Select the Repo*
es: *Seleccione el Repositorio*

source: Then select the branch to sync from the drop down
es: Luego seleccione la rama que usted quiere sincronizar del menú desplegable

source: *Select the Branch*
es: *Seleccione la Rama*

source: Repeat the process for the Remote
es: Repita el proceso para el Remoto

source: *Select the Remote and Branch*
es: *Seleccione el Remoto y la Rama*

source: Click on the :guilabel:`Add` button to complete adding the sync
es: Dele clic en la tecla de :guilabel:`Agregar` para completar la adición de la sincronización

source: Manual Sync
es: Sincronización Manual

source: Once a remote is set up then you can sync between the two GeoGit repositories.
es: Una vez que un remoto ha sido configurado, entonces usted puede sincronizar entre los dos repositorios de GeoGit.

source: Click on the up and down arrows by the name of the remote you want to sync. This initiates a one-time push/pull
es: Dele clic en las flechas hacia arriba y hacia abajo por el nombre del remoto que usted desea sincronizar. Esto se inicia una sola vez con empujar/halar

source: *Manual Sync*
es: *Sincronización Manual*

source: Automatic Sync
es: Sincronización Automática

source: You can set up the remote to sync automatically every minute.
es: Usted puede configurar el remoto para que automáticamente se sincronice cada minuto.

source: Click on the arrows that form a box. As long as this button is depressed, the sync will occur automatically.
es: Dele clic a las flechas que forman el cuadro. Mientras esta tecla esta presionada, la sincronización ocurrirá automáticamente.

source: *Auto Sync*
es: *Auto Sincronización*

source: To toggle the automatic sync, click the button again.
es: Para alternar la sincronización automática, nuevamente dele clic a la tecla.
