Repository: Argonne-EVS/rogue_geonode
Catalog: docs/source/_build/locale/*/LC_MESSAGES/history.po
Languages: es

source: Working with History
es: Trabajando con el Historial

source: GeoGit is a specialized database that was designed for distributed editing and supports collaborative editing of geospatial data. It is designed for vector data (point, line, polygon, etc.). When a layer has been stored in GeoGit, it maintains the history of all of the changes made to the data along with who made the changes and when. Within the web map, you can view the history for a layer and for the features.
es: GeoGit es una base de datos especializada que fue diseñada para distribuir y apoyar la edición en colaboración de los fatos geoespaciales editados. Ha sido diseñada para los datos de vector (punto, línea y polígono entre otros). Cuando una capa es guardada en GeoGit, esta mantiene su historial de todos los cambios realizados a los datos, junto con la persona que hizo los cambios y cuando se hicieron los cambios. Dentro del mapa de la web, usted puede visualizar todo el historial de esa capa, así como para las características.

source: History tab in GeoNode
es: La Viñeta del Historial en GeoNode

source: GeoGit layers in GeoNode will have a History tab in addition to the other tabs on the Layer detail page. The history is a list of commits that have been made to the layer.
es: Las capas de GeoGit en GeoNode, tendrán una viñeta de historial a parte de las otras viñetas en la página de detalles de la capa. El historial es una lista de confirmaciones que se han realizado a la capa.

source: In the Layer detail page, click on the history tab to see the chronological list of commits.
es: En la página de detalles de la capa, dele clic a la viñeta del historial para poder visualizar la lista en orden cronológico de las confirmaciones.

source: *Layer history tab in GeoNode*
es: *La Viñeta del Historial de la Capa en GeoNode*

source: In order to search through the commit history, type in the search box in the :guilabel:`History` tab. You can search for any value in the commit history.
es: A manera de buscar a través del historial de confirmaciones, en la casilla de búsqueda ingrese :guilabel:`Historial` en la viñeta. En el historial de la compromiso, Usted puede realizar la búsqueda de cualquier valor.

source: View layer history
es: Mire el Historial de la Capa

source: You can view the history of a layer.
es: Usted puede visualizar el historial de la capa.

source: Click on the name of the layer you want to view. The menu will expand to show additional layer options.
es: Dele clic en el nombre de la capa que usted quiere visualizar. El menú se expandirá a manera de mostrar las opciones adicionales de la capa.

source: Click on the :guilabel:`Show History` button. The history will expand at the bottom.
es: Dele clic a la tecla de :guilabel:`Mostrar el Historial `. El historial se expandirá en la parte inferior.

source: *Show History Button for Layers*
es: *Mostrar la Tecla del Historial para las Capas*

source: To view details about a commit, hover the mouse over it. The bar next to the commit indicates the type of edits that were made. Green indicates a new feature was added. Yellow indicates a feature was modified. Red indicates a feature was deleted. A commit can have multiple types of edits. In such a case, the bar will have colors proportional to the types of edits that were made.
es: Para poder ver los detalles acerca de un compromiso, mueva el ratón sobre ella. La barra junto a la compromiso indica el tipo de ediciones fueron llevadas a cabo. El color verde indica que se agregó una nueva característica. El color amarillo indica que una característica fue modificada. El color rojo indica que una característica fue eliminada. Un compromiso puede tener múltiples tipos de ediciones. En tal caso, la barra tendrá colores proporcionales a los tipos de las ediciones que fueron llevadas a cabo.

source: *History detail for a commit*
es: *Detalle del Historial para una Compromiso*

source: Click on the commit and the history will update to show the individual edits within that commit. MapLoom will make one commit per edit. The Arbiter mobile app can upload many edits as one commit.
es: Dele clic al compromiso y el historial se actualizara para mostrar las ediciones del individuo para con ese compromiso. MapLoom hará un compromiso por cada una de las ediciones. La aplicación móvil de Arbiter, puede cargar varias ediciones como un compromiso.

source: *List of edits in a commit*
es: *Lista de las ediciones en un compromiso*

source: Clicking on an edit will bring up a new window that shows the specific changes that were made. The changes will be highlighted with the same color coding as the commits. Green means something was added, yellow means it was changed, and red means it was deleted. In the image below, the feature was moved, and so the point on the map is highlighted in yellow.
es: Al darle clic en una edición, esta abrirá una nueva ventana que muestre los cambios específicos que fueron llevados a cabo. Los cambios serán resaltados con el mismo código de color, como en los compromisos. El color verde significa que algo fue agregado, el color amarillo significa que algo ha sido cambiado y el color rojo significa que algo fue eliminado. En las imágenes que a continuación se presentan, la característica fue movida, así que el punto en el mapa es resaltado en amarillo.

source: *Detailed view of changes*
es: *Visualización detallada de los cambios*

source: View feature history
es: Visualizar la historia del elemento

source: In addition to viewing the history of edits on a GeoGit layer, you can also view the history of a feature.
es: Agregado a visualizar la historia de las ediciones en una capa de GeoGit, usted también puede ver el historial del elemento.

source: Click on the feature on the map. The feature details will appear.
es: Dele clic a la característica en el mapa. Aparecerán los detalles del elemento.

source: Click on the :guilabel:`Show History` button. The history list will expand with the commits that contain changes for that feature.
es: Dele clic a la tecla de :guilabel:`Mostrar el Historial `. La lista del historial se expandirá con los compromisos que contengan los cambios para elemento.

source: *Show History for a feature*
es: *Mostrar el Historial para el elemento*

source: Click on the specific commit you want to view details for. The history will update to show the edits made to the feature for that commit.
es: Dele clic al compromiso específico en el que usted quiere visualizar los detalles de este. El historial se actualizara para mostrar las ediciones llevadas a cabo a la característica de ese compromiso.

source: Clicking on the edit in the list will bring up a new window that shows the specific changes that were made. The changes will be highlighted with the same color coding as the commits. Green means something was added, yellow means it was changed, and red means it was deleted. In the image below, the feature was moved, and so the point on the map is highlighted in yellow.
es: Dele clic en la lista de las ediciones, la que abrirá una nueva ventana que muestra los cambios específicos que fueron llevados a cabo. Los cambios serán resaltados con la misma codificación de colores. El color verde significa que algo ha sido agregado, el color amarillo significa que algo ha sido agregado y el color rojo significa que algo ha sido eliminado. En la imagen a continuación, la característica fue movida, y por lo tanto el punto en el mapa ha sido resaltado en amarillo.

source: Click on the :guilabel:`Show Authors` button to see the names and dates for every attribute in the feature. Note that through the lifetime of a feature, there can be several authors. This is a good way to see who has contributed to a feature's current state.
es: Dele clic a la tecla de :guilabel:`Muestre los Autores ` para poder ver los nombres y las fechas para cada uno de los atributos en la característica. Note que puede haber varios autores a través del tiempo de vida de la característica. Esta es una buena forma de ver quien ha contribuido al estado actual de la característica.

source: *The Show Authors button*
es: *La Tecla para Mostrar los Autores*

source: Summarize history
es: Resumen del Historial

source: You can visualize a summary of all of the edits within a date range for a layer.
es: Usted puede visualizar un resumen de todas las ediciones dentro de un rango de fechas para una capa.

source: Click on the :guilabel:`Show History` button for layer that you want to summarize.
es: Dele clic en la tecla de :guilabel:`Muestre el Historial ` para la capa que usted quiere resumir.

source: Click on the :guilabel:`History Summary` button.
es: Dele clic en la tecla :guilabel:`Resumen del Historial`.

source: *History Summary button*
es: *Tecla del Resumen del Historial*

source: Enter the date range for the history to summarize
es: Ingrese el rango de fechas a ser resumidas por el historial

source: *Select the Date Range*
es: *Seleccione los Rangos de las Fechas*

source: Click on the :guilabel:`Summarize` button
es: Dele clic a la tecla de :guilabel:`Resumir`

source: *Summary of changes for the selected date range*
es: *Resumen de los Cambios para los Rangos de Fecha Seleccionados*

source: Click on one of the edits in the list to see a detailed view
es: Dele clic en una de las ediciones en la lista para tener una visualización detallada

source: Export history
es: Exportando el Historial

source: You can export a summary of all of the edits within a date range for a layer.
es: Usted puede exportar un resumen de todas las ediciones dentro de un rango de fechas para una capa.

source: Click on the :guilabel:`Export CSV` button
es: Dele clic a la tecla de :guilabel:`Exportar CSV`

source: When you are prompted to save the file, browse to the location where you want to save it to your hard drive and click :guilabel:`Ok`
es: Cuando se le solicite que guarde un archivo, navegue por la ubicación en donde usted quiere guardar el archivo en su disco duro y dele clic a :guilabel:`Ok`
