Repository: Argonne-EVS/rogue_geonode
Catalog: docs/source/_build/locale/*/LC_MESSAGES/layerinfo.po
Languages: es

source: Layer information
es: Información de la capa

source: Every layer has its own page with information about it. This page contains lots of options for managing this layer. The page displays information about the layer such as
es: Cada una de las capas tiene su propia página con información acerca de ella. Esta página contiene muchas opciones para manejar esta capa. La página despliega la información acerca de la capa, tal y como la

source: Info
es: Información

source: Attributes
es: Atributos

source: History
es: Historia

source: Comments
es: Comentarios

source: Legend
es: Leyenda

source: Maps using this layer
es: Mapas utilizando esta capa

source: Permissions
es: Permisos

source: Styles (associated with the layer)
es: Estilos (asociados con la capa)

source: Owner, point of contact, and author information
es: El dueño, punto de contacto, así como la información del autor

source: Layer Detail Tabs
es: Las viñetas con los detalles de la capa

source: There are up to four tabs that describe a layer: :guilabel:`Info`, :guilabel:`Attributes`, :guilabel:`History`, and :guilabel:`Comments`.
es: Hay hasta cuatro viñetas que describen una capa: :guilabel:`Información`, :guilabel:`Atributos`, :guilabel:`Historia` y :guilabel:`Comentarios`.

source: The :guilabel:`Info` tab is the default tab, and presents basic information about the layer. It also shows the overall average rating, and allows you to rate the layer.
es: La viñeta de :guilabel:`Información` es una viñeta que es predeterminada y que presenta la información básica acerca de la capa. Así mismo muestra el promedio general de los puntajes y le permite calificar su capa.

source: *Layer Info tab*
es: *La viñeta de información de la capa*

source: The :guilabel:`Attributes` tab lists the attributes of the layer, including statistics (range, average, median and standard deviation). Layer attribute statistics are made available only for numeric attributes. If a layer's attributes are not numeric, then no statistics will be calculated.
es: La :guilabel: La viñeta de `Atributos` proporciona una lista de los atributos de la capa, incluyendo las estadísticas (rango, promedio, desviación estándar y media). Las estadísticas de los atributos de la capa están disponibles solamente para los atributos númericos. Si los atributos de una capa no son númericos, entonces las estadÌsticas no se podrán calcular.

source: *Attributes tab*
es: *Viñeta de Aributos*

source: The :guilabel:`History` tab is available when the layer is a GeoGit layer and it shows the history of activity on that layer.
es: La viñeta de :guilabel: `Historia` está disponible cuando una capa es una capa de GeoGit y muestra el historial de la actividad en esa capa.

source: The :guilabel:`Comments` tab allows you to leave a comment for others viewing this layer.
es: La :guilabel: viñeta de los `Comentarios` le permite a usted dejar un comentario para que el resto de las personas que están viendo esa capa lo vean.

source: *Layer Comments tab*
es: *La viñeta de los comentarios de la capa*

source: The :guilabel:`Add Comment` button allows you to enter a comment about the layer.
es: La tecla de :guilabel:`Agregar Comentario` le permite ingresar un comentario acerca de la capa.

source: *Adding a new comment*
es: *Agregando un nuevo comentario*
