Repository: Argonne-EVS/rogue_geonode
Catalog: docs/source/_build/locale/*/LC_MESSAGES/layermanage.po
Languages: es

source: Editing Metadata and Managing Layers
es: Editar las capas de los meta datos y administración

source: Every layer has its own page with information about it. The layer page also provides a menu for options to edit information about the layer and manage the layer.
es: Cada una de las capas tiene su propia página con la información acerca de la capa. La página de la capa también proporciona un men˙ con las opciones para poder editar la información acerca de la capa, asÌ como administrar la capa.

source: Edit Metadata
es: Editar los meta datos

source: Metdata is information about the layer. It contains details such as the owner, title, purpose, restrictions, and more. This is where you can also edit the Abstract - which is the description that shows up for the layer in GeoNode.
es: Los meta datos es la información acerca de la capa. Contiene detalles acerca de por ejemplo quien es el dueño, el título, el propósito, restricciones y mucho más. Aquí también puede editar el Abstracto - que es la descripción que muestra la capa en GeoNode.

source: Click on the Edit Layer button and select Edit Metadata. This will take you to the metadata page.
es: Dele clic a la tecla de editar la capa y seleccione Editar los Meta Datos. Esto lo llevará a la página de los meta datos.

source: Edit information in the fields as appropriate.
es: Editar la información en los campos de la forma más apropiada.

source: Click Update at the bottom of the form to save the changes
es: Dele clic a la tecla de actualizar en la parte inferior de la forma para salvar los cambios.

source: Edit Permissions
es: Editar los Permisos

source: Layer permissions are set at the time of import. Permissions can be adjusted as needed by those who have the proper rights to administer the layer. The Permissions window allows you to manage who can view and download the data, who can edit the data, and who can manage the data.
es: Los permisos de la capa son configurados en el momento de la importación. Los permisos pueden ser ajustados en la medida de lo necesario por aquellas personas que tengan los derechos apropiados para administrar la capa. La ventana de permisos le permite administrar quien puede ver y descargar ls datos, quien puede editar los datos y quien puede administrar los datos.

source: Click on the Edit Layer button and select Edit Permissions
es: Dele clic a la tecla de Editar la Capa y seleccione Permisos de Edición

source: Make adjustments to permissions as needed.
es: En la medida de los necesario, haga los ajustes correspondientes a los permisos.

source: Click Apply Changes to persist your changes.
es: Dele clic a Aplicar los Cambios, para conservar sus cambios.

source: Manage Styles
es: Estilos de Administración

source: A layer can have a number of different styles associated with it. There is a default style associated with the layer and there can be others that represent different views of the data.
es: Una capa puede tener un número de diferentes estilos asociados con el. Hay un estilo predeterminado que está asociado con la capa y puede haber otros que representan las diferentes vistas de los datos.

source: Click on the Edit Layer button and select Manage Styles.
es: Dele clic a la tecla de editar y seleccione Administrar los Estilos.

source: The Manage Styles page shows the available styles on the left and the styles associated with the layer on the right.
es: La página de la Administración de Estilos, a la izquierda muestra los estilos disponibles y a la derecha, muestra los estilos asociados con la capa.

source: To select a style, click on the name of the style in the left-hand list. The style will move to the right-hand list
es: Para seleccionar un estilo, dele clic en el nombre del estilo en la lista que se encuentra en el lado izquierda. El estilo se moverá a la lista del lado derecho.

source: To remove a style, click on the name of the style in the right-hand list and then click the arrows between the lists.
es: Para eliminar un estilo, dele clic al nombre del estilo en la lista que se encuentra en el lado derecho y luego dele clic a las flechas que se encuentran entre las listas.

source: To persist your changes, click the Update Available Styles button.
es: Para conservar sus cambios, dele clic a la tecla de actualizar los Estilos Disponibles.

source: Replace a Layer
es: Reemplace una Capa

source: Selecting "Replace This Layer" allows you to import data in place of the existing layer.
es: Al seleccionar "Reemplace esta Capa", le permite importar los datos en lugar de la capa existente.

source: Click on the Edit Layer button and select Replace This Layer.
es: Dele clic en la capa y seleccione Remplazar esta Capa.

source: Follow the instructions to upload a new file in place of the old layer.
es: Siga las instrucciones para cargar un nuevo archivo en el lugar de la vieja capa.

source: Remove a Layer
es: Elimine una Capa

source: Removing a layer will remove it completely from GeoNode for all users.
es: Al eliminar una capa, esta se eliminara completamente desde GeoNode para todos los usuarios.

source: Click on the Edit Layer button and select Remove This Layer
es: Dele clic a la tecla de Editar la Capa y seleccione Eliminar esta Capa

source: Click "Yes, I am sure" to remove the layer, or "No, don't remove it" to cancel the action.
es: Dele clic a "Sí, Yo estoy seguro" de eliminar esta capa, o "No, no estoy seguro de eliminar la capa" para cancelar la acción.
