Repository: Argonne-EVS/rogue_geonode
Catalog: docs/source/_build/locale/*/LC_MESSAGES/layerupload.po
Languages: es

source: Uploading a layer
es: Subir una capa

source: GeoNode allows you to upload layers. The supported formats are shapefile, KML, and GeoTiff. Once the layers are uploaded, they will be available to other users in GeoNode.
es: GeoNode le permite a usted el poder subir las capas. Los formatos de apoyo son shapefile, KML y GeoTiff. Una vez que las capas hayan sido cargadas, estarán a la disposición de los otros usuarios en GeoNode.

source: Click the :guilabel:`Layers` link on the top toolbar. This will bring up the Layers menu.
es: Dele clic al vínculo de :guilabel:`Capas` en la barra de herramientas en la parte superior. Esto jalara el Menú de las Capas.

source: *Main toolbar for GeoNode*
es: *Principal barra de herramientas para GeoNode*

source: *Layers menu*
es: *Menú de las Capas*

source: Click :guilabel:`Upload Layers` in the Layers toolbar. This will bring up the upload form
es: Dele clic a :guilabel:`Subir las capas` en la barra de herramientas de las capas. Esto traera la forma de subir.

source: *Layers toolbar*
es: *Barra de herramientas de las capas*

source: *Upload Layers form*
es: *Forma de subir las capas*

source: Either browse to the files to be uploaded or drag and drop them in the browser. Note that many files consist of multiple files to be complete. If you are uploading a shapefile, then you need to include the .dbf, .prj, .shp, and .shx files.
es: Ya sea navegando o arrastrando los archivos a ser cargados y dejándolos caer en el navegador. Note que muchos de los archivos consisten de múltiples archivos a ser completados. Sí usted est· cargando un shapefile, entonces usted necesitar· incluir los archivos .dbf, .prj, .shp y .shx.

source: Click on the :guilabel:`Browse...` button. This will bring up a local file dialog. Navigate to your data folder and select all of the four files composing the geospatial layer. Note that some data formats consist of multiple files. If you are uploading a shapefile, then you need to include the .dbf, .prj, .shp, and .shx files. Alternatively you could drag and drop the four files in the :guilabel:`Drop files here` area. The upload form should appear like this now:
es: Dele clic a la tecla de :guilabel:`Navegar...` . Esto jalará un dialogo de archivo local. Navegue hasta su carpeta de datos y seleccione uno de los cuatro archivos que componen la capa geoespacial. Note que algunos de los formatos de los datos consisten de múltiples archivos. Si usted está cargando un archivo shapefile, entonces usted necesita incluir los archivos .dbf, .prj, .shp y .shx. Alternativamente usted podrá arrastrar y dejar caer los cuatro archivos en el rea de :guilabel:`Dejar caer los archivos aquí`.

source: *Files ready for upload*
es: *Los archivos están listos para ser cargados*

source: GeoNode has the ability to restrict who can view, edit, and manage layers. On the right side of the page, under :guilabel:`Who can view and download this data?`, select :guilabel:`Any registered user`. This will ensure that anonymous view access is disabled.
es: El GeoNode tiene la capacidad de restringir quien puede ver, editar y administrar las capas. En el lado derecho de la página, bajo :guilabel:`Quién puede ver y descargar estos datos?`, seleccione la :guilabel:`Cualquier usuario registrado`. Esto asegurará que el acceso de anónimos para ver este deshabilitado.

source: In the same area, under :guilabel:`Who can edit this data?`, select the :guilabel:`Only the following users or groups` option and type your username. This will ensure that only you are able to edit the data in the layer.
es: En la misma área, bajo :guilabel:`Quién puede editar estos datos?`, seleccione la opción e introduzca su nombre de usuario :guilabel:`Solamente los siguientes usuarios o grupos`. Esto asegurar· que solamente usted puede editar los datos en la capa.

source: *Permissions for new layer*
es: *Permisos para una nueva capa*

source: If no destination is selected, the files will be imported into the default spatial data store for GeoNode. This will always be the destination for raster data. If you have vector data that you want to be versioned, then check the box for 'Import to GeoGit'. The form will update to provide a dropdown menu for existing GeoGit repositories. To use an existing repository as the destination, select it in the dropdown. In order to import the data into a new GeoGit repository: 1. type the name of the repository and 2. select that name in the dropdown so it appears in the field.
es: Si no se seleccione ningún destino, el archivo será importado al almacenamiento predeterminado de datos espaciales para GeoNode. Este siempre será el destino para conservar los datos. Si usted tiene datos vectores que usted quiere ser versionada, luego revise la casilla para 'Importar a GeoGit'. La forma será actualizada para proporcionar un menú desplegable para los repositorios de GeoGit existentes. Para utilizar un deposito existente como destino, selecciónelo en el menú desplegable. A manera de importar los datos a un depósito nuevo de GeoGit: 1. Introduzca el nombre del depósito y 2. seleccione el nombre en el menú desplegable por lo que aparece en el campo.

source: Click :guilabel:`Upload` to upload the data and create a layer. A dialog will display showing the progress of the upload.
es: Dele clic a :guilabel:`Subir` para cargar los datos y crear una capa. Un dialogo se desplegara mostrando el progreso de la descarga.

source: *Upload in progress*
es: *Subir en Progreso*

source: Your layer has been uploaded to GeoNode. Now you will be able to access to the its info page (clicking on the :guilabel:`Layer Info` button), access to its metadata edit form (clicking on the :guilabel:`Edit Metadata` button) or to manage the styles for it (clicking on the :guilabel:`Manage Styles` button).
es: Su capa ha sido cargada a GeoNode. Ahora usted podrá acezar a su página de información (dele clic a la tecla de :guilabel:`Información de la Capa`), acceso a so forma de editar sus meta datos (al darle clic a la tecla de :guilabel:`Editar Meta Datos`) o administrar los estilos para ello (al darle clic a la tecla en :guilabel:`Estilos de Administración).
