Repository: Argonne-EVS/rogue_geonode
Catalog: docs/source/_build/locale/*/LC_MESSAGES/layerdownload.po
Languages: es

source: Downloading Data from a Layer
es: Descargando los datos desde una capa

source: At the top of the page there are two buttons titled :guilabel:`Download Layer` and :guilabel:`Download Metadata`. These buttons provide access to the ability to extract geospatial data and metadata from within GeoNode. In this way, GeoNode allows for two way data and metadata access; one can import as well as export data.
es: En la parte superior de la página hay dos teclas tituladas :guilabel:`Descargar Capa` y :guilabel:`Descargar los Meta Datos`. Estas teclas proporcionan el acceso para que la capacidad extraiga los datos geoespaciales y los meta datos desde GeoNode. De esta manera, GeoNode le permite el acceso a través de dos vías, la de los datos y la de los meta datos; uno puede importar asÌ como exportar los datos.

source: Click the :guilabel:`Download Layer` button. You will see a list of options of the supported export formats.
es: Dele clic a :guilabel: la tecla de 'Descargar Capa'. Usted vera una lista de opciones de los formatos de exportación compatible.

source: *Available export formats*
es: *Formatos de exportación disponibles*

source: Click the option for the desired format.
es: Para el formato deseado dele clic al a la opción.

source: GeoNode will process the request and bring up a Save As dialog. Save this file to your computer.
es: GeoNode procesara el requerimiento y traerá un dialogo de salvar. Salve este archivo en su computadora.

source: Click the :guilabel:`Download Metadata` button. You will see a list of options of the supported export formats.
es: Dele clic a a la tecla de :guilabel:`Descargar los Meta Datos`. Usted mirará una serie de opciones de los formatos de exportación compatibles.

source: *Available metadata export formats*
es: *Los formatos disponibles de exportación de los meta datos*

source: Click the option for the desired metadata format.
es: Dele clic a la opción para el formato de meta datos deseados.

source: GeoNode will process the request and display XML metadata.
es: GeoNode procesará el requerimiento y desplegara los meta datos XML.
