Repository: Argonne-EVS/rogue_geonode
Catalog: docs/source/_build/locale/*/LC_MESSAGES/mapinfo.po
Languages: es

source: Managing Maps
es: Administrando los Mapas

source: Every map has it's own page that provides more information about the map along with other options such as permissions and metadata. To get to the page for a map, click on the name of the map.
es: Cada mapa tiene su propia página que proporciona más información acerca del mapa junto con otras opciones como ser los permisos y los meta datos. Para obtener la página para un mapa, dele clic al nombre del mapa.

source: The map detail page provides a view of the map, along with information about the map. It also tells you the layers that are used in the map.
es: La página de detalles del mapa proporciona una vista del mapa, junto con otra información acera del mapa. También le informa sobre las capas que son utilizadas en el mapa.

source: Download Data Layers
es: Descarga de las Capas de los Datos

source: This will allow you to download the contents of the map that are stored in GeoNode. It does not download data from other servers, however.
es: Esto le permitirá descargar los contenidos del mapa que están almacenados en GeoNode. Sin embargo, no descarga los datos de otros servidores.

source: Click on the :guilabel:`Download Map` button.
es: Dele clic a la tecla en :guilabel:`Descargar el Mapa`.

source: *Download map menu*
es: *Descarga el menú del mapa*

source: Select :guilabel:`Download Data Layers`
es: Selecciona :guilabel`Descargar las capas de los datos`

source: Select the layer(s) that you want to download individually OR click on :guilabel`Start downloading this map`
es: Seleccione la capa o capas que usted quiere descargar individualmente O dele clic a :guilabel`Comience la descarga de este mapa`

source: Download Web Map Context
es: Descargue el Contexto del Mapa de la Web

source: The Web Map Context (WMC) is an open geospatial consortium (OGC) standard for metadata describing a map service.
es: El Contexto del Mapa de la Web (WMC) es un consorcio de est·ndares geoespaciales abierto (OGC) para los meta datos que describen un servicio de mapas.

source: Click on the :guilabel:`Download Web Map Context` button. A new tab will open with the XML for the web map context.
es: Dele clic a la tecla de :guilabel:`Descargar el Contexto del Mapa de la Web`. Se abrirá una nueva viñeta con XML para el contexto del mapa de la web.

source: Edit Map Metadata
es: Edite los Meta Datos del Mapa

source: You can edit the information about the map.
es: Usted puede editar la información acerca del mapa.

source: Click on the :guilabel:`Edit Map` button
es: Dele clic a la tecla en :guilabel:`Editar el Mapa`

source: *Edit map menu*
es: *Menú para Editar el Mapa*

source: Click on Edit Map Metadata
es: Dele clic en editar los meta datos del mapa

source: In the metadata page, update the information about the map.
es: En la página de los metadatos, actualice la información acera del mapa.

source: Click the :guilabel:`Update` button at the bottom of the page to save your changes.
es: Dele clic a la tecla de :guilabel:`Actualizar` que se encuentra en la parte inferior de la página, a manera de salvar sus cambios.

source: Set Map Thumbnail
es: Configure el pequeño mapa (thumbnail)

source: By default the thumbnail images for maps will only have the vector layers. In order to include the background map you will need to use the Set Map Thumbnail button.
es: Al tener las imágenes de los mapas en miniatura predeterminadas solamente tendrán las capas de los vectores. A manera de incluir el mapa de fondo, usted necesitará utilizar la tecla de Configurar los Mapas en Miniatura.

source: Pan and zoom the inset map so that it's centered on the view you would like for the map thumbnail.
es: Recorra y amplíe el mapa insertado a manera de que se centre en la vista que usted quisiera para el mapa en miniatura

source: Click on :guilabel:`Set Map Thumbnail`. This will set the map thumbnail with the base map and layers included.
es: Dele clic en :guilabel:`Configure el Mapa en Miniatura`. Esto establecerá el mapa en miniatura con la base del mapa y las capas incluidas.

source: *Map with thumbnail*
es: *Mapa con la miniatura*

source: Edit Map Permissions
es: Edite los Permisos del Mapa

source: The map permissions determine which users can view or edit a map.
es: Los permisos del mapa determinan que usuarios pueden ver o editar el mapa.

source: Set the permissions for viewing, editing, and managing as desired.
es: Establezca los permisos para ver, editar y administrar segán usted lo desee.

source: Click the :guilabel:`Apply Changes` button.
es: Dele clic a la tecla en :guilabel:`Aplicar los Cambios`.

source: Remove a Map
es: Elimine el Mapa

source: You can remove a map completely from GeoNode. This action removes the map for all users.
es: Usted puede eliminar completamente un mapa desde GeoNode. Esta acción elimina el mapa para todos los usuarios.

source: Click on the :guilabel:`Remove This Map` button
es: Dele clic a la tecla en :guilabel:`Eliminar este Mapa`

source: Confirm the removal of the map by clicking :guilabel:`Yes, I am Sure`
es: Confirme la eliminación del mapa dándole clic a :guilabel:`Sí, estoy seguro`
