Repository: Argonne-EVS/rogue_geonode
Catalog: docs/source/_build/locale/*/LC_MESSAGES/profile.po
Languages: es

source: Managing your profile
es: Administrando su perfil

source: Your profile contains information about you.
es: Su perfil contiene información acerca de usted.

source: Click on your user name in the top right of the screen. A drop-down list will show. Click on :guilabel:`Profile` to enter the Profile settings page.
es: Dele clic en el nombre del usuario localizado en la esquina superior derecha en la pantalla. Se desplegara una lista. Dele clic en :guilabel:`Perfil` para ingresar a la página de configuración del perfil.

source: *Link to your profile*
es: *Vínculo a su perfil*

source: The next page shows your profile, which is currently empty.
es: La siguiente página muestra su perfil, el cual, actualmente, se encuentra vacio.

source: *Profile page*
es: *Página de perfil*

source: Click the :guilabel:`Edit profile information` link.
es: Dele clic al :guilabel:`Edite la información del perfil`.

source: *Link to edit your profile*
es: *Vinculo para editar su perfil*

source: On this page, you can update your information, including your avatar. Enter some details in the :guilabel:`Profile` box as well as your city and country info.
es: En esta página, usted puede actualizar su información, incluyendo el avatar. Ingrese algunos detalles en el casilla del perfil también agregue información de su ciudad y país.

source: *Editing your profile*
es: *Editando su perfil*

source: When finished, click :guilabel:`Update profile`.
es: Una vez que haya terminado, dele clic a :guilabel:`Actualizar el perfil`.

source: *Link to save your profile updates*
es: *Vinculo para guardar las actualizaciones de su perfil*

source: You will be returned to the main profile page. Now click :guilabel:`Account settings`.
es: Usted sera regresado a la página principal del perfil. Ahora dele click a :guilabel:`Configuraciones de la Cuenta`.

source: *Link to edit your account settings*
es: *Vincule para editar las configuraciones de su cuenta*

source: On this page you can change your email address, time zone, and language. Your email should be populated already, but set the timezone to your current location.
es: En esta página usted puede cambiar su dirección de correo electrónico, el huso horario, así como el idioma. Ya debería de estar su correo electrónico poblado, pero establezca el huzo a su ubicación actual.

source: *Editing your account*
es: *Editando su cuenta*

source: When finished, click :guilabel:`Save`.
es: Una vez que haya terminado, dele clic a :guilabel:`Guardar`.
