Repository: Argonne-EVS/rogue_geonode
Catalog: docs/source/_build/locale/*/LC_MESSAGES/registration.po
Languages: es

source: Creating a new account
es: Creando una cuenta nueva

source: Before you can save or edit any layers on a GeoNode instance, you need to create an account.
es: Antes de que usted pueda guardar o editar cualquier capa en una instancia de GeoNode, usted necesitar crear una cuenta.

source: From any page in the web interface, you will see a :guilabel:`Register` link. Click that link, and the register form will appear.
es: Desde cualquier página en el interfase de la web, usted podré ver un :guilabel:`Registrar'. Haga clic en ese enlace y aparecerá el formulario de registro.

source: The registrations in GeoNode must be open, in case you don't see the register link then it's not possible to register unless the addministrator of the site does that for you.
es: Los registros en GeoNode deben estar abiertos. En caso de que usted no puede ver el enlace de registro, entonces no es posible registrar a menos que el administrador del sitio lo hace por usted.

source: *Sign in screen*
es: *Iniciar sesión con pantalla*

source: On the next page, fill out the form. Enter a user name and password in the fields. Also, enter your email address for verification.
es: En la página siguiente, rellene el siguiente formulario. Introduzca un nombre de usuario y contraseña en los campos. También, introduzca su dirección de correo electrónico para la verificación.

source: *Registering for a new account*
es: *Registrarse para una cuenta*

source: You will be returned to the welcome page. An email will be sent confirming that you have signed up. While you are now logged in, you will need to confirm your account. Navigate to the link that was sent in the email.
es: Usted ser redirigido a la página de bienvenida. Un correo electrónico será enviado confirmando que se haya registrado. Mientras que usted está ahora conectado, tendrá que confirmar su cuenta. Desplácese hasta el enlace que se envió en el correo electrónico.

source: *Confirming your email address*
es: *Confirmando su dirección de correo electrónico*

source: Click :guilabel:`Confirm`. You will be returned to the homepage.
es: Clic a :guilabel:`Confirme`. Usted ser redirigido a la página de inicio.
