Repository: Argonne-EVS/rogue_geonode
Catalog: docs/source/_build/locale/*/LC_MESSAGES/search.po
Languages: es

source: Finding Content in GeoNode
es: Encontrando el Contenido en GeoNode

source: **GeoNode Search**
es: **Búsqueda de GeoNode**

source: You will find the *Search* field at the top of every GeoNode page. When you type in the search field, GeoNode will list the Layers, Maps, and Documents that match the text you've entered. Click on the word in the list to go to that resource.
es: Usted encontrar el campo de *Búsqueda* al principio de cada una de las páginas de GeoNode. Cuando usted introduzca en el campo de búsqueda, GeoNode enumerar la lista de las capas, mapas y documentos que coinciden con el texto que ha ingresado. Dele clic a la palabra en la lista para ir a ese recurso.

source: *GeoNode Toolbar*
es: *Barra de Herramientas de GeoNode*

source: **Browsing Layers**
es: **Capas de Navegación**

source: The *Layers* page lets you browse data that has been uploaded to this GeoNode. From the *Layers* page, you can see how many times a layer has been viewed and it's average user rating. You can also *Download* the layer data, create a map, or go to a the layer detail page.
es: La página de las *Capas* le permite navegar los datos que han sido cargados a este GeoNode. Desde la página de las *Capas* usted puede ver cuéntas veces una capa ha sido vista y su su calificación promedio de usuario. Usted también puede *Descargar* la capa de los datos, crear un mapa, o a la página de detalle de la capa.

source: *Layers Page*
es: *La Página de las Capas*

source: *View by Layer Type*
es: *Ver por tipo de capa*

source: The view in the layers page can be subset by Raster or Vector
es: La vista en la página de capas puede ser subconjunto por Raster o Vector

source: **Browsing Maps**
es: **Navegación de Mapas**

source: The *Maps* page lets you browse data that has been uploaded to this GeoNode. From the *Maps* page, you can see how many times a map has been viewed and it's average user rating. You can also *Download* the layers for the map, view the map, or go to a the map detail page for more information.
es: La página de los *Mapas* le permite navegar los datos que han sido cargados a esté GeoNode. Desde la página de los *Mapas*, usted puede ver cuéntas veces un mapa ha sido visto y su calificación promedio del usuario. Usted también puede *Descargar* las capas para el mapa, ver el mapa o ir a la página de detalle del mapa para obtener más información.

source: *Maps Page*
es: *La Página de los Mapas*

source: **Filtering Results**
es: **Filtrando los Resultados**

source: There are several different ways to manage the list of the maps, layers or documents you're viewing. The *Layers*, *Maps* and *Documents* pages provide the ability to filter by categories, date range, or keywords.
es: Existen varias formas para administrar las listas de los mapas, capas o documentos que usted esta viendo. Las páginas de las *Capas*, *Mapas* y *Documentos*, le proporcionan la capacidad de filtrar por categorias, rangos de datos o palabras claves.

source: *Filter by Categories*
es: *Filtrar por Categorías*

source: *Category Filter*
es: *Filtrar por Categoría*

source: You can filter Layers or Maps by Categories. When the metadata for a layer or a map has been tagged with a specific category, it will be reflected in the *Categories* panel. Clicking on the first category limits the layer list to those tagged with that category. Clicking on another category adds the layers from that category to the layer list. Clicking on the category again will remove it from the layer list.
es: usted puede filtrar las capas o los mapas por categorías. Cuando los meta datos para una capa o mapa ha sido etiquetado con una categoría en especÌfico, ser· reflejado en el panel de las *categorías*. Dándole clic a la primera categoría limita la lista de capas a aquellas que han sido etiquetadas en esa categoría. Dándole clic a otra categoría, agrega capas de esa categoría a la lista de las capas. Dándole nuevamente clic a una categoría, la eliminar· de la lista de las capas.

source: *Filter by Date Range*
es: *Filtrar por Rango de Datos*

source: *Date Range Filter*
es: *Filtrando el Rango de los Datos*

source: You can limit the list of layers or maps by a date range. In the *Date* panel select the start date and the end date for the date range. The view will update to reflect those layers or maps that were created within that timeframe.
es: Usted puede limitar la lista de las capas o mapas a través de un rango de datos. En el panel de la *Fecha*, seleccione una fecha de inicio y una fecha final para el rango de los datos. La vista se acualizar para reflejar esas capas o mapas que fueron creadas dentro de ese límite de tiempo.

source: *Filter by Keywords*
es: *Filtrar por Palabras Claves*

source: You can filter the *Layers* or *Maps* associated with a particular keyword. The keywords are saved in the metadata. To edit the keywords for an item you need to go to the *Edit Metadata* tab for the specific item (map, layer or document).
es: Usted puede filtrar las *Capas* o *Mapas* que estén asociados con una palabra clave en particular. Las palabras claves son salvadas en los meta datos. Para editar las palabras claves para un ítem, usted necesita ir a la vióeta de *Editar meta datos* para un ítem en particular (mapa, capa o documento).

source: *Keyword Filter*
es: *Filtro de Palabra Clave*
